Tekla.Structures.ModelInternal.PropertyFormatEnum
The enum for the format of property from PSet

Tekla.Structures.ModelInternal.PropertyFormatEnum.Date
Date time format

Tekla.Structures.ModelInternal.PropertyFormatEnum.Uri
Url format

Tekla.Structures.ModelInternal.PropertyFormatEnum.String
The string value

Tekla.Structures.ModelInternal.PropertyFormatEnum.Number
The number value, can be used for decimal or double values

Tekla.Structures.ModelInternal.PropertyFormatEnum.Boolean
Boolean value, can be FALSE or TRUE

Tekla.Structures.ModelInternal.PropertyFormatEnum.Array
The array of values, can be used for enum or string values

Tekla.Structures.ModelInternal.PropertyFormatEnum.Integer
The integer value, can be used for enum values

Tekla.Structures.ModelInternal.PropertyFormatEnum.NoFormat
No format